app/controllers/songs_controller.rb

  def new
    # If the Artist params are valid && Artist doesn't exist...
    if params[:artist_id] && !Artist.exists?(params[:artist_id])
---
SELECT "artists".* FROM "artists"

  def edit
    # If the artist_id params are valid...
    if params[:artist_id]
      # Find the artist_id, assign the instance to the artist_id
      @artist = Artist.find_by(id: params[:artist_id])
      # If the artist doesn't exist...
      if @artist.nil?
        # Redirect to the artists index, alert the user
        redirect_to artists_path, alert: "Artist not found."
      else
        # Make sure the song belongs to the author, then assign it to the instance
        @song = @artist.songs.find_by(id: params[:id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1234]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT 1  [["artist_id", 1], ["id", 1234]]